// language indexes: EN=0, UA=1, BY=2, RU=3;

export const languages = {
  signIn: ['Sign in ', 'Увійти ', 'Увайсці ', 'Войти '],
  register: ['Register ', 'Реєстрація ', 'Рэгiстрацыя ', 'Регистрация '],
  returnWelcomePage: [
    ' To Welcome Page',
    ' На стартову сторінку',
    ' На стартавую старонку',
    ' На стартовую страницу',
  ],
  startPage: ['Start Page', 'На стартову', 'На стартавую', 'На стартовую'],
  createBoard: ['New board', 'Нова дошка', 'Новая дошка', 'Новая доска'],
  editProfile: ['Edit profile', 'Редаг. профіль', 'Рэдаг. профіль', 'Редакт. профиль'],
  signOut: ['Sign out', 'Вийти', 'Выйсці', 'Выйти'],
  toBoards: ['Boards', 'Дошки', 'Дошкi', 'Доски'],
  welcome: [
    'Welcome to our task manager',
    'Вітаємо у нашому таск-менеджері',
    'Вiтаем у нашым таск-менеджэры',
    'Добро пожаловать в наш таск-менеджер',
  ],
  about: ['About the team:', 'Про команду:', 'Аб камандзе:', 'О команде:'],
  Max: ['Maksym Dudniev', '', 'Максiм Дуднеў', 'Максим Дуднев'],
  Den1: ['Dzianis Matsveyeu', 'Денис ', 'Дзянiс Мацвееў', 'Денис Матвеев'],
  Den2: ['Dzianis Valkovich', 'Денис Валковiч', 'Дзянiс Валковiч', 'Денис Волкович'],
  Den2Part: [
    `Participation in the project:\n
    - Welcome Page\n
    - Header and Footer\n
    - Localization\n
    - Styling and decoration`,
    `Участь у проекті: \n
    - Вітальна сторінка\n
    - Хедер i Футер\n
    - Локалізація\n
    - Стилізація та оформлення\n`,
    `Удзел у праекце: \n
    - Вітальная старонка\n
    - Хэдэр i Футэр\n
    - Лакалізацыя\n
    - Стылізацыя i афармленне\n`,
    `Участие в проекте: \n
    - Приветственная страница\n
    - Хедер и Футер\n
    - Локализация\n
    - Стилизация и оформление\n
    `,
  ],
  haveReg: ['Already have an account?', 'Вже є акаунт?', 'Ужо ёсць акаўнт?', 'Уже есть аккаунт?'],
  notHaveReg: [
    'Don`t have an account yet?',
    'Ще немає акаунту?',
    'Яшчэ няма акаўнта?',
    'Ещё нет аккаунта?',
  ],
  registration: ['Registration', 'Реєстрація', 'Рэгістрацыя', 'Регистрация'],
  authorization: ['Authorization', 'Авторизація', 'Аўтарызацыя', 'Авторизация'],
  name: ['Name', 'Ім`я', 'Iмя', 'Имя'],
  login: ['Login', 'Логін', 'Логiн', 'Логин'],
  password: ['Password', 'Пароль', 'Пароль', 'Пароль'],
  submit: ['Submit', 'Підтвердити', 'Пацвердзіць', 'Подтвердить'],
  formWarnMin: [
    '*only letters and numbers & min 3 chars',
    '*тільки літери та цифри & мін. 3 символи',
    '*толькі літары i лічбы & мін. 3 сімвала',
    '*только буквы и цифры & мин. 3 символа',
  ],
  formWarnMax: [
    '*only letters and numbers & max 20 chars',
    '*тільки літери та цифри & до 20 символів',
    '*толькі літары i лічбы & да 20 сімвалаў',
    '*только буквы и цифры & до 20 символов',
  ],
  requiredFieldNote: [
    '*this is required field',
    '*це обов`язкове поле',
    '*гэта абавязковае поле',
    '*это обязательное поле',
  ],
  userExist: [
    'User login already exist!',
    'Користувач із таким логіном вже існує!',
    'Карыстальнік з такім лагінам ужо існуе!',
    'Пользователь с таким логином уже существует!',
  ],
  userNotExist: [
    'User was not founded!',
    'Користувач не знайдений!',
    'Карыстальнік не знойдзены!',
    'Пользователь не найден!',
  ],
  successRegister: [
    'You have successfully registered!',
    'Ви успішно зареєстровані!',
    'Вы паспяхова зарэгістраваны!',
    'Вы успешно зарегистрированы!',
  ],
  notFoundPage: [
    'Page not found...',
    'Сторінку не знайдено...',
    'Старонка не знойдзена...',
    'Страница не найдена...',
  ],
  compaireColumn: [
    '*this name is reserved!',
    '*ця назва за резервована!',
    '*гэта назва за рэзервавана!',
    '*это название зарезервировано!',
  ],
};
