export const languages = {
  signIn: ['Sign in ', 'Увійти', 'Увайсці', 'Войти'],
  register: ['Register ', 'Реєстрація', 'Рэгiстрацыя', 'Регистрация'],
  createBoard: ['Create board', 'Створити доску', 'Стварыць доску', 'Создать доску'],
  editProfile: ['Edit profile', 'Редагувати профіль', 'Рэдагаваць профіль', 'Редакт. профиль'],
  signOut: ['Sign out', 'Вийти', 'Выйсці', 'Выйти'],
  welcome: [
    'Welcome to our task manager',
    'Вітаємо у нашому таск-менеджері',
    'Вiтаем у нашым таск-менеджэры',
    'Добро пожаловать в наш таск-менеджер',
  ],
  about: ['About the team:', 'Про команду:', 'Аб камандзе:', 'О команде:'],
};
